{
  "backend/main.mo": "Actor implementing user profiles, check-ins, pairing invite code features, and admin-gated RSVP/invite management with authorization and state modules.",
  "backend/migration.mo": "Migration module upgrading stored userProfiles by adding a default avatar field to each profile.",
  "feature_evidence.json": "Feature evidence report listing frontend files, components, and test IDs for avatar-related and paired-experience features.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing various frontend React components, hooks, and utilities.",
  "frontend/index.css": "Tailwind base and theme variables defining a warm color palette for light and dark modes plus global border and body styles.",
  "frontend/index.html": "Static HTML entry point mounting the SPA root and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Main application flow handling authentication, profile setup, pairing, and navigation between dashboard, emotional map, and settings views.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button component handling Internet Identity login/logout with loading and error handling.",
  "frontend/src/components/avatars/AvatarBadge.tsx": "Avatar badge component rendering a user's avatar or fallback via avatarUtils with size variants.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout component showing flags, avatars, and auth controls based on identity, pairing, and profile state.",
  "frontend/src/features/checkins/CheckInComposer.tsx": "UI for composing and submitting daily check-ins with emoji, message, premium limits, and success states.",
  "frontend/src/features/checkins/constants.ts": "Defines available emoji options and the max message length for check-ins.",
  "frontend/src/features/checkins/TodayStatusCard.tsx": "Displays today's check-in status for the user and partner, showing counts, latest entries, and loading state.",
  "frontend/src/features/checkins/useCheckInHistory.ts": "Hook fetching historical check-ins from the actor with a configurable limit.",
  "frontend/src/features/checkins/useSubmitCheckIn.ts": "Hook for submitting a check-in and invalidating related query caches.",
  "frontend/src/features/checkins/useTodayCheckIns.ts": "Hook fetching the current day's check-ins from the actor.",
  "frontend/src/features/country/countries.ts": "Builds and exports a cleaned, sorted country list from ISO data and a lookup helper.",
  "frontend/src/features/country/CountriesMapSelector.tsx": "Country selection component using a searchable popover list built from predefined country data.",
  "frontend/src/features/country/flagEmoji.ts": "Converts two-letter country codes into Unicode flag emojis.",
  "frontend/src/features/country/iso3166Alpha2.ts": "Provides the complete ISO 3166-1 alpha-2 dataset of country codes and names.",
  "frontend/src/features/country/worldMapPaths.ts": "Empty file with no content.",
  "frontend/src/features/dashboard/CheckInHistoryList.tsx": "Displays the user's and partner's recent check-in history with loading, empty, and detailed list states.",
  "frontend/src/features/dashboard/DashboardView.tsx": "Renders the main dashboard with daily check-in tools, relationship status, streaks, and history tabs.",
  "frontend/src/features/emotionalmap/EmotionalMapView.tsx": "Shows both partners' latest daily check-ins and compares their emotional states with syncing messages.",
  "frontend/src/features/pairing/PairingCard.tsx": "Provides UI to generate an invite code or join a partner using a token, with copy and validation support.",
  "frontend/src/features/pairing/useDisconnectPartner.ts": "Mutation hook that disconnects a partner and invalidates related queries.",
  "frontend/src/features/pairing/useInviteToken.ts": "Generates an invite token via mutation and stores it for sharing.",
  "frontend/src/features/pairing/useJoinWithToken.ts": "Attempts to join a partner using an invite token and refreshes pairing-related queries.",
  "frontend/src/features/pairing/usePairingStatus.ts": "Fetches the current partner and partner profile to determine pairing status and related info.",
  "frontend/src/features/profile/AvatarPicker.tsx": "Avatar selector with emoji presets, popover UI, preview, and clear option.",
  "frontend/src/features/profile/avatarUtils.ts": "Utility functions for validating, normalizing, and generating avatar presets and fallbacks.",
  "frontend/src/features/profile/ProfileSetupDialog.tsx": "Dialog component for creating or completing a user profile with name, avatar, and country, saving via mutation.",
  "frontend/src/features/profile/useGetCallerUserProfile.ts": "React Query hook that loads the current user's profile from the backend actor.",
  "frontend/src/features/profile/useHasPremium.ts": "Hook that checks whether the current user has premium status using the backend actor.",
  "frontend/src/features/profile/useSaveCallerUserProfile.ts": "Mutation hook to save the user's profile, validating fields and preserving backend-managed data.",
  "frontend/src/features/relationshipStatus/ChangeRelationshipStatusControl.tsx": "UI control for changing relationship status with validation, mutation, and toast notifications.",
  "frontend/src/features/relationshipStatus/ChooseRelationshipStatusView.tsx": "View for selecting an initial relationship status, saving via mutation and notifying on success or error.",
  "frontend/src/features/relationshipStatus/relationshipStatusColors.ts": "Maps relationship statuses to Tailwind color classes and provides a lookup helper.",
  "frontend/src/features/relationshipStatus/relationshipStatusOptions.ts": "Defines the list of available relationship status strings.",
  "frontend/src/features/relationshipStatus/useRelationshipStatusState.ts": "Hook that fetches relationship status state, providing loading and derived status info.",
  "frontend/src/features/relationshipStatus/useSetRelationshipStatus.ts": "Mutation hook to update the relationship status and invalidate related queries.",
  "frontend/src/features/settings/SettingsView.tsx": "Settings page allowing users to edit profile fields, manage partner connection, and update relationship status.",
  "frontend/src/features/streak/StreakSection.tsx": "Component displaying the shared streak count with animation on increase and conditional rendering when paired.",
  "frontend/src/features/streak/useSharedStreak.ts": "Hook that fetches the shared streak count from the backend actor.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identities, handling login/logout, and exposing identity status to components.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating queries are organized by feature directories.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode values, and global typography and layout rules.",
  "frontend/src/lib/checkInHelpers.ts": "Provides a helper to retrieve the latest check-in for a specific author from a list.",
  "frontend/src/main.tsx": "Bootstraps the app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, including persisted URL values.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling theming via CSS variables, plugins, custom colors, animations, and responsive settings.",
  "project_state.json": "Stores project metadata, feature summaries, architectural notes, and known issues for the application."
}