{
  "backend/main.mo": "Main Motoko canister defining user profiles, check-ins, invite code generation, RSVP handling, and access-controlled queries and updates.",
  "backend/migration.mo": "Migration module converting old user profile structures to newer ones by removing deprecated fields while preserving actor state.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to frontend files, components, and related tests for relationship status updates and settings controls.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend components, hooks, and configuration files.",
  "frontend/index.css": "Global Tailwind layer defining OKLCH color variables, dark mode overrides, and base styles for the app.",
  "frontend/index.html": "Static HTML entry point that mounts the app and loads the main TypeScript bundle.",
  "frontend/src/App.tsx": "Top-level React component handling authentication, profile setup, pairing flow, relationship status checks, and view navigation.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button providing login/logout with Internet Identity and clearing React Query cache on logout.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper showing flags, relationship status, branding, auth button, and page structure with header, main, and footer.",
  "frontend/src/features/checkins/CheckInComposer.tsx": "UI for creating and submitting a check‑in with emoji and message, handling premium limits, submission states, and validation.",
  "frontend/src/features/checkins/constants.ts": "Defines available emoji options for check‑ins and the maximum message length.",
  "frontend/src/features/checkins/TodayStatusCard.tsx": "Displays today's check‑ins for the user and partner, including loading, latest entries, counts, and status indicators.",
  "frontend/src/features/checkins/useCheckInHistory.ts": "React Query hook that fetches historical check‑ins from the actor with a configurable limit.",
  "frontend/src/features/checkins/useSubmitCheckIn.ts": "Mutation hook for submitting a new check‑in and invalidating related queries on success.",
  "frontend/src/features/checkins/useTodayCheckIns.ts": "React Query hook that retrieves today's check‑ins from the actor.",
  "frontend/src/features/country/countries.ts": "Builds and exports a sorted, deduplicated list of countries from the ISO dataset and provides lookup by code.",
  "frontend/src/features/country/CountriesMapSelector.tsx": "Country selection component with searchable popover list based on the COUNTRY dataset.",
  "frontend/src/features/country/flagEmoji.ts": "Converts a two‑letter ISO country code into its corresponding flag emoji.",
  "frontend/src/features/country/iso3166Alpha2.ts": "Exports the full ISO‑3166‑1 alpha‑2 country code dataset used for country listings.",
  "frontend/src/features/country/worldMapPaths.ts": "Placeholder file with no implemented content.",
  "frontend/src/features/dashboard/CheckInHistoryList.tsx": "Displays a user's recent check-in history with loading, empty, and list states.",
  "frontend/src/features/dashboard/DashboardView.tsx": "Main dashboard showing streaks, today's check-in tools, and history tabs.",
  "frontend/src/features/emotionalmap/EmotionalMapView.tsx": "Shows emotional comparison between partners based on today's check-ins with sync status.",
  "frontend/src/features/pairing/PairingCard.tsx": "UI for generating invite tokens and joining a partner via code with copy and error handling.",
  "frontend/src/features/pairing/useDisconnectPartner.ts": "Mutation hook to disconnect partners and invalidate related queries.",
  "frontend/src/features/pairing/useInviteToken.ts": "Generates and stores an invite token using a mutation with error and loading states.",
  "frontend/src/features/pairing/useJoinWithToken.ts": "Handles joining a partner via invite token and refreshes pairing-related queries.",
  "frontend/src/features/pairing/usePairingStatus.ts": "Fetches partner principal and profile, exposing pairing status and metadata.",
  "frontend/src/features/profile/ProfileSetupDialog.tsx": "Modal for entering or completing a user profile with name and country selection.",
  "frontend/src/features/profile/useGetCallerUserProfile.ts": "Loads the current user's profile with actor-based querying and loading state.",
  "frontend/src/features/profile/useHasPremium.ts": "Queries whether the current user has premium status.",
  "frontend/src/features/profile/useSaveCallerUserProfile.ts": "Saves the user's profile with validation and invalidates profile queries on success.",
  "frontend/src/features/relationshipStatus/ChangeRelationshipStatusControl.tsx": "UI control for viewing and updating the user’s relationship status with mutation handling and toast feedback.",
  "frontend/src/features/relationshipStatus/ChooseRelationshipStatusView.tsx": "Initial selection view allowing users to choose a relationship status and save it via mutation.",
  "frontend/src/features/relationshipStatus/relationshipStatusColors.ts": "Maps relationship statuses to Tailwind color classes and provides a helper to fetch appropriate colors.",
  "frontend/src/features/relationshipStatus/relationshipStatusOptions.ts": "Defines the list and type of available relationship status options.",
  "frontend/src/features/relationshipStatus/useRelationshipStatusState.ts": "Query hook to load and expose the user's relationship status and loading states.",
  "frontend/src/features/relationshipStatus/useSetRelationshipStatus.ts": "Mutation hook to update the user's relationship status and invalidate related queries.",
  "frontend/src/features/settings/SettingsView.tsx": "Settings page for managing country, relationship status, and partner disconnection with related mutation flows.",
  "frontend/src/features/streak/StreakSection.tsx": "Displays the shared streak count with animation on increments when paired.",
  "frontend/src/features/streak/useSharedStreak.ts": "Query hook that retrieves the shared streak count from the actor.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting that queries are organized by feature modules.",
  "frontend/src/index.css": "Tailwind base file defining theme variables for light and dark modes.",
  "frontend/src/lib/checkInHelpers.ts": "Utility to get the latest check-in for a specific author.",
  "frontend/src/main.tsx": "App entry point that initializes React, QueryClient, Internet Identity, and global styles.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), store them in sessionStorage, retrieve them later, and clear them from the URL or storage.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the project's state, feature descriptions, architectural notes, known issues, and existing functionality for a relationship app with Firebase backend."
}