{
  "backend/main.mo": "Main canister actor implementing user profiles, premium flags, pairing via tokens, and check‑in storage with authorization checks.",
  "backend/migration.mo": "Migration module converting old user profiles to the new schema by adding a default premium=false field.",
  "feature_evidence.json": "Feature evidence report mapping premium-related frontend updates to affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend source file in the project.",
  "frontend/index.css": "Global Tailwind CSS theme definitions with custom OKLCH color tokens for light and dark modes.",
  "frontend/index.html": "Base HTML entry point mounting the React application and loading main.tsx.",
  "frontend/src/App.tsx": "Root application component handling auth flow, profile setup, pairing, and routing to the dashboard.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button with Internet Identity integration and query cache clearing.",
  "frontend/src/components/layout/AppLayout.tsx": "Shared page layout with header, partner badge, optional auth button, main content, and footer.",
  "frontend/src/features/checkins/CheckInComposer.tsx": "UI component for submitting daily check-ins with emoji and message, handling premium limits and submission states.",
  "frontend/src/features/checkins/constants.ts": "Defines available emoji options and the maximum check-in message length.",
  "frontend/src/features/checkins/TodayStatusCard.tsx": "Displays today's check-in status for the user and partner, showing latest entries and loading states.",
  "frontend/src/features/checkins/useCheckInHistory.ts": "React Query hook to fetch historical check-ins using the backend actor.",
  "frontend/src/features/checkins/useSubmitCheckIn.ts": "Mutation hook for submitting a new check-in and invalidating related queries.",
  "frontend/src/features/checkins/useTodayCheckIns.ts": "React Query hook to fetch today's check-ins from the backend actor.",
  "frontend/src/features/dashboard/CheckInHistoryList.tsx": "Displays up to 30 past check-ins with timestamps and user/partner distinctions.",
  "frontend/src/features/dashboard/DashboardView.tsx": "Main dashboard view combining today’s status, check-in composer, and history tabs.",
  "frontend/src/features/pairing/PairingCard.tsx": "UI for generating invite codes and joining a partner using a token with copy and error handling.",
  "frontend/src/features/pairing/useInviteToken.ts": "Hook to generate and store an invite token through the backend actor.",
  "frontend/src/features/pairing/useJoinWithToken.ts": "Hook for joining a partner using an invite token and refreshing pairing-related queries.",
  "frontend/src/features/pairing/usePairingStatus.ts": "Fetches pairing status and partner profile, exposing partner data and loading state.",
  "frontend/src/features/profile/ProfileSetupDialog.tsx": "Modal for entering and saving a user's display name via a mutation and refreshing the profile query.",
  "frontend/src/features/profile/useGetCallerUserProfile.ts": "Hook that fetches the current user's profile from the actor when available.",
  "frontend/src/features/profile/useHasPremium.ts": "Hook that queries whether the current user has a premium subscription.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, identity loading, and login state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting that queries are organized per feature.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining light and dark theme colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity, and renders the app.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Defines the project’s state, features, architecture notes, and premium limitations for a relationship check‑in app using Firebase. Lists implemented features such as authentication, pairing, daily check-ins, dashboard, theming, and premium multi-check-in support."
}