{
  "backend/main.mo": "Main Motoko canister with access control, invite code handling, user profiles (including country), RSVPs, and check‑ins.",
  "backend/migration.mo": "Migration module converting old user profiles to new ones by adding a country field.",
  "feature_evidence.json": "Feature evidence report linking feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend source files for reference in build planning.",
  "frontend/index.css": "Global Tailwind setup defining theme variables and light/dark mode color tokens.",
  "frontend/index.html": "HTML entry point loading the React app into the root container.",
  "frontend/src/App.tsx": "Main app component handling authentication, profile setup, pairing flow, relationship status gating, and paired navigation.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button wired to Internet Identity with loading and error handling.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper providing header, footer, identity-aware pairing badge, and toaster notifications.",
  "frontend/src/features/checkins/CheckInComposer.tsx": "UI component for composing and submitting a check-in, handling emoji selection, message input, premium limits, and success states.",
  "frontend/src/features/checkins/constants.ts": "Defines available emoji options and maximum message length for check-ins.",
  "frontend/src/features/checkins/TodayStatusCard.tsx": "Displays today's check-in status for the user and partner, including latest entries and loading states.",
  "frontend/src/features/checkins/useCheckInHistory.ts": "React Query hook fetching historical check-ins with a limit parameter.",
  "frontend/src/features/checkins/useSubmitCheckIn.ts": "Mutation hook for submitting a check-in and invalidating related queries on success.",
  "frontend/src/features/checkins/useTodayCheckIns.ts": "React Query hook retrieving today's check-ins from the backend.",
  "frontend/src/features/country/countries.ts": "Static list of country codes and names with a helper to look up countries by code.",
  "frontend/src/features/country/CountriesMapSelector.tsx": "Interactive map and dropdown component for selecting a country by clicking or searching.",
  "frontend/src/features/country/worldMapPaths.ts": "Simplified SVG path data for countries used to render an interactive world map selector.",
  "frontend/src/features/dashboard/CheckInHistoryList.tsx": "Renders a list of past check-ins with user/partner labels, dates, and loading or empty states.",
  "frontend/src/features/dashboard/DashboardView.tsx": "Renders the main dashboard with daily check-in UI, status display, streaks, and tabs for today's check-in and history.",
  "frontend/src/features/emotionalmap/EmotionalMapView.tsx": "Shows an emotional comparison between partners based on today's check-ins, handling loading, pairing status, and emoji-based mood display.",
  "frontend/src/features/pairing/PairingCard.tsx": "Provides UI to generate an invite code or join a partner using a code, with copy, input, and mutation handling states.",
  "frontend/src/features/pairing/useDisconnectPartner.ts": "Mutation hook that disconnects the current partner and invalidates all pairing-related queries.",
  "frontend/src/features/pairing/useInviteToken.ts": "Generates and stores an invite token using a mutation, exposing loading and error states.",
  "frontend/src/features/pairing/useJoinWithToken.ts": "Mutation hook to join a partner using a token and invalidate related profile and pairing queries.",
  "frontend/src/features/pairing/usePairingStatus.ts": "Fetches partner principal and profile to determine pairing status and partner name.",
  "frontend/src/features/profile/ProfileSetupDialog.tsx": "Dialog for initial profile setup allowing users to enter name and country before saving.",
  "frontend/src/features/profile/useGetCallerUserProfile.ts": "Query hook retrieving the current user's profile with loading state tied to actor availability.",
  "frontend/src/features/profile/useHasPremium.ts": "Query hook checking whether the current user has a premium subscription.",
  "frontend/src/features/profile/useSaveCallerUserProfile.ts": "Mutation to save the caller’s profile and invalidate the current profile query.",
  "frontend/src/features/relationshipStatus/ChooseRelationshipStatusView.tsx": "UI for choosing a relationship status, triggering a save mutation and calling a completion callback.",
  "frontend/src/features/relationshipStatus/useRelationshipStatusState.ts": "Fetches relationship status and user profile to determine chooser permissions and current status state.",
  "frontend/src/features/relationshipStatus/useSetRelationshipStatus.ts": "Mutation hook to update relationship status with permission checks and query invalidation.",
  "frontend/src/features/settings/SettingsView.tsx": "Renders settings UI allowing users to edit their country and disconnect from a partner with confirmation dialogs and profile mutations.",
  "frontend/src/features/streak/StreakSection.tsx": "Displays the shared streak count with a pulse animation when it increases, hiding content if unpaired or loading.",
  "frontend/src/features/streak/useSharedStreak.ts": "Provides a React Query hook to fetch the shared streak from the backend actor.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages a backend actor tied to the user’s identity and refreshes dependent queries when changed.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity persistence via a React context provider.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file indicating queries are organized within feature directories.",
  "frontend/src/index.css": "Sets Tailwind base styles, CSS variables for themes, and global styling for light and dark modes.",
  "frontend/src/lib/checkInHelpers.ts": "Utility to get the most recent check‑in for a specific author from a list.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, typography, and component settings.",
  "project_state.json": "Stores the project’s versioned state, architectural plans, known issues, and existing feature definitions for a relationship check‑in app using Firebase."
}