{
  "backend/main.mo": "Motoko canister defining user profiles, check-ins, invite codes, and access‑controlled actions for managing RSVPs, pairing, and profile data.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and related test cases.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files across authentication, profile setup, pairing, check-ins, and dashboard features.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light and dark themes and applying global background and text styling.",
  "frontend/index.html": "HTML entrypoint that mounts the React app and loads the main TypeScript bundle.",
  "frontend/src/App.tsx": "Root React component handling auth flow, profile setup, pairing, relationship status gating, and switching between main views.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and query cache clearing on logout.",
  "frontend/src/components/layout/AppLayout.tsx": "App layout wrapper showing flags and relationship‑colored heart when paired, plus header, footer, auth button, and content slot.",
  "frontend/src/features/checkins/CheckInComposer.tsx": "UI component for composing and submitting a daily check‑in with emoji and message, handling premium limits and success states.",
  "frontend/src/features/checkins/constants.ts": "Defines available mood emojis and the maximum message length for check‑ins.",
  "frontend/src/features/checkins/TodayStatusCard.tsx": "Displays today's check‑ins for the user and partner, showing status, latest entries, and loading states.",
  "frontend/src/features/checkins/useCheckInHistory.ts": "React Query hook that fetches historical check‑ins from the backend with a configurable limit.",
  "frontend/src/features/checkins/useSubmitCheckIn.ts": "Mutation hook for submitting a check‑in and invalidating related queries on success.",
  "frontend/src/features/checkins/useTodayCheckIns.ts": "React Query hook that loads today's check‑ins for the authenticated user.",
  "frontend/src/features/country/countries.ts": "Builds and exports a deduplicated, alphabetized ISO country list and lookup helper.",
  "frontend/src/features/country/CountriesMapSelector.tsx": "Popover-based searchable country selector using the ISO country list.",
  "frontend/src/features/country/flagEmoji.ts": "Converts a two‑letter ISO country code into its flag emoji using regional indicator symbols.",
  "frontend/src/features/country/iso3166Alpha2.ts": "Exports the full ISO 3166‑1 alpha‑2 dataset of country codes and names.",
  "frontend/src/features/country/worldMapPaths.ts": "Empty placeholder file for world map path data.",
  "frontend/src/features/dashboard/CheckInHistoryList.tsx": "Renders a list of recent check‑ins with dates, authorship labels, and loading/empty states.",
  "frontend/src/features/dashboard/DashboardView.tsx": "Renders the main dashboard with relationship status, streak section, and tabs for today’s check-in and history.",
  "frontend/src/features/emotionalmap/EmotionalMapView.tsx": "Displays both partners’ latest emotional check-ins with loading, pairing checks, and an emotional comparison message.",
  "frontend/src/features/pairing/PairingCard.tsx": "Provides UI for generating an invite code and joining a partner using a token, with copy and loading states.",
  "frontend/src/features/pairing/useDisconnectPartner.ts": "Mutation hook to disconnect from a partner and invalidate related pairing and profile queries.",
  "frontend/src/features/pairing/useInviteToken.ts": "Generates an invite token through the actor and exposes token state, loading, and error handling.",
  "frontend/src/features/pairing/useJoinWithToken.ts": "Mutation hook to join with an invite token and refresh partner-related queries on success.",
  "frontend/src/features/pairing/usePairingStatus.ts": "Fetches partnered principal and profile data and returns pairing status, names, and loading state.",
  "frontend/src/features/profile/ProfileSetupDialog.tsx": "Dialog for creating or completing a user profile with name and country selection, including validation and save handling.",
  "frontend/src/features/profile/useGetCallerUserProfile.ts": "Loads the current user profile via actor and exposes loading and fetch status.",
  "frontend/src/features/profile/useHasPremium.ts": "Queries whether the current user has premium status using the actor.",
  "frontend/src/features/profile/useSaveCallerUserProfile.ts": "Saves the caller’s profile with validation and invalidates the profile query on success.",
  "frontend/src/features/relationshipStatus/ChooseRelationshipStatusView.tsx": "UI for selecting and saving a relationship status with loading feedback and completion callback.",
  "frontend/src/features/relationshipStatus/relationshipStatusColors.ts": "Maps relationship statuses to Tailwind color classes and provides a helper to retrieve colors.",
  "frontend/src/features/relationshipStatus/useRelationshipStatusState.ts": "Fetches current relationship status and user profile, exposing flags for chooser status and loading state.",
  "frontend/src/features/relationshipStatus/useSetRelationshipStatus.ts": "Provides a mutation to set the relationship status with permission checks and query invalidation.",
  "frontend/src/features/settings/SettingsView.tsx": "Renders settings UI for managing country selection and partner disconnection with related mutations and dialogs.",
  "frontend/src/features/streak/StreakSection.tsx": "Displays the shared streak count with animation when updated, hiding content if unpaired or loading.",
  "frontend/src/features/streak/useSharedStreak.ts": "Queries the actor for the shared streak value, converting it to a number.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting that queries are organized in feature directories.",
  "frontend/src/index.css": "Defines Tailwind base layers and CSS variables for light and dark themes.",
  "frontend/src/lib/checkInHelpers.ts": "Helper to get the latest check-in by a specific author from a list.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, typography, container queries, and plugin setup.",
  "project_state.json": "Defines the project’s current app features, architecture notes, known issues, and versioned state for a relationship app using Firebase."
}