{
  "backend/main.mo": "Main Motoko canister implementing access control, invite code handling, user profiles with required country, check-ins, and related queries and mutations.",
  "backend/migration.mo": "Migration module converting old user profiles with optional country to new profiles with mandatory country and removing obsolete check-in data.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend files across authentication, profile, pairing, check-ins, dashboard, and styling.",
  "frontend/index.css": "Base Tailwind CSS configuration defining global OKLCH color tokens, dark mode variants, and common element styling.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component managing authentication, mandatory country onboarding, pairing flow, and routing between dashboard-related views.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and query cache clearing on logout.",
  "frontend/src/components/layout/AppLayout.tsx": "Application layout providing header, pairing badge, footer, and optional auth button with consistent theming and toast support.",
  "frontend/src/features/checkins/CheckInComposer.tsx": "Renders the UI for composing a daily check‑in, handling emoji selection, message input, submission, and premium limits.",
  "frontend/src/features/checkins/constants.ts": "Defines available mood emojis and the maximum check‑in message length.",
  "frontend/src/features/checkins/TodayStatusCard.tsx": "Displays today's check‑ins for the user and partner, showing status, counts, and latest messages.",
  "frontend/src/features/checkins/useCheckInHistory.ts": "React Query hook fetching historical check‑ins from the backend with a configurable limit.",
  "frontend/src/features/checkins/useSubmitCheckIn.ts": "Mutation hook to submit a new check‑in and invalidate related queries on success.",
  "frontend/src/features/checkins/useTodayCheckIns.ts": "React Query hook retrieving today's check‑ins for the authenticated user.",
  "frontend/src/features/country/countries.ts": "Builds and exports a deduplicated, sorted list of countries from the ISO dataset.",
  "frontend/src/features/country/CountriesMapSelector.tsx": "Interactive map and dropdown component for selecting a country by clicking or searching.",
  "frontend/src/features/country/iso3166Alpha2.ts": "Provides the full ISO‑3166‑1 alpha‑2 country code dataset.",
  "frontend/src/features/country/worldMapPaths.ts": "Contains simplified SVG paths for countries used to render an interactive world map.",
  "frontend/src/features/dashboard/CheckInHistoryList.tsx": "Displays a user's recent check-ins with loading, empty, and populated states, highlighting whether each entry is from the user or their partner.",
  "frontend/src/features/dashboard/DashboardView.tsx": "Main dashboard showing today's check-in tools, streaks, and history via tabbed navigation.",
  "frontend/src/features/emotionalmap/EmotionalMapView.tsx": "Shows today's emotional comparison between partners based on their latest check-ins and provides a status message.",
  "frontend/src/features/pairing/PairingCard.tsx": "UI for generating an invite code or joining a partner using a code, including copy and error handling.",
  "frontend/src/features/pairing/useDisconnectPartner.ts": "Mutation hook that disconnects the current partner and invalidates all related queries.",
  "frontend/src/features/pairing/useInviteToken.ts": "Hook that generates and stores an invite token using a backend actor.",
  "frontend/src/features/pairing/useJoinWithToken.ts": "Hook that joins a partner via invite token and refreshes pairing-related queries.",
  "frontend/src/features/pairing/usePairingStatus.ts": "Query hook fetching the user's partner and their profile to determine pairing status.",
  "frontend/src/features/profile/ProfileSetupDialog.tsx": "Dialog for entering or completing a user profile with name and country selection.",
  "frontend/src/features/profile/useGetCallerUserProfile.ts": "Query hook retrieving the current user's profile from the backend actor.",
  "frontend/src/features/profile/useHasPremium.ts": "Query hook checking whether the current user has premium status.",
  "frontend/src/features/profile/useSaveCallerUserProfile.ts": "Mutation hook saving the user's profile with validation and cache invalidation.",
  "frontend/src/features/relationshipStatus/ChooseRelationshipStatusView.tsx": "UI component allowing users to select and submit a relationship status via mutation with loading and error handling.",
  "frontend/src/features/relationshipStatus/useRelationshipStatusState.ts": "Hook fetching current relationship status and user profile to determine permissions and loading state.",
  "frontend/src/features/relationshipStatus/useSetRelationshipStatus.ts": "Mutation hook that updates relationship status with permission checks and invalidates related queries.",
  "frontend/src/features/settings/SettingsView.tsx": "Settings page enabling country editing and partner disconnection with confirmation dialogs and related mutations.",
  "frontend/src/features/streak/StreakSection.tsx": "Displays the shared streak with animation when it increases, hiding content if unpaired or loading.",
  "frontend/src/features/streak/useSharedStreak.ts": "Hook fetching the numeric shared streak from the backend actor.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user identity and refetches dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity authentication, login state, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file noting that queries are organized by feature directories.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining light and dark theme color tokens.",
  "frontend/src/lib/checkInHelpers.ts": "Utility to return the most recent check-in from a specific author.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, identity provider, and rendering the root app.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from both session and the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, and container settings with plugins.",
  "project_state.json": "JSON describing the project’s current state, architecture, known issues, and implemented features for a relationship app with check-ins and shared streaks."
}