{
  "kind": "build_request",
  "title": "Replace country world map with simple selector and show partner flags + relationship-colored heart in header",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-41",
      "text": "Remove the interactive world map from the country selection UI and replace it with a simple searchable country selector only (dropdown/command search), while preserving the existing ISO-3166-1 alpha-2 country dataset and the existing profile save flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "quitale ese mapa solo pon que se seleccione pais"
        ]
      },
      "acceptanceCriteria": [
        "In the profile setup flow, users can select a country using a searchable selector without any map or SVG world map being rendered.",
        "In Settings > Country edit, users can select a country using the same searchable selector without any map being rendered.",
        "All countries remain selectable using the existing ISO-3166-1 alpha-2 dataset.",
        "User-facing helper text is updated to remove any mention of clicking on a map (English only)."
      ]
    },
    {
      "id": "REQ-42",
      "text": "When two paired users have both saved a valid country, display both users’ country flags at the very top of the app (in the global header area), with a heart icon between them.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "cuando los dos usuarios escojan su pais que salga arriba de todo las baderas de los paises de los usuarios con un corazon"
        ]
      },
      "acceptanceCriteria": [
        "If the user is not authenticated, no flags/heart header element is shown.",
        "If the user is authenticated but not paired, no flags/heart header element is shown.",
        "If paired but either the current user or partner does not yet have a country saved (empty string), no flags/heart header element is shown.",
        "If paired and both countries are present, the header shows: [current user flag] [heart] [partner flag].",
        "Flags render correctly from ISO alpha-2 country codes (e.g., US -> 🇺🇸) without requiring new backend calls beyond existing profile/pairing/profile queries."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Set the heart icon color (between the two flags) based on the current shared relationship status value; if no relationship status exists, use a neutral/default heart color.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "el color depende del estado de la relacion"
        ]
      },
      "acceptanceCriteria": [
        "When relationship status is available, the heart color changes deterministically according to a defined mapping for the existing statuses used in the app (Friendship, Almost Something, Situationship, Relationship, Engaged, Married).",
        "When relationship status is null/absent, the heart uses a neutral/default color and does not break layout.",
        "All user-facing text remains in English (no new Spanish UI strings introduced)."
      ]
    }
  ],
  "constraints": [
    "Frontend must not modify any files under frontend/src/components/ui (shadcn components must be composed, not edited).",
    "Frontend must not modify immutable paths listed in SYSTEM_CONTEXT (including frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend remains single-actor; do not introduce additional canisters/services."
  ],
  "nonGoals": [
    "Do not reintroduce any interactive map or SVG world map for country selection.",
    "Do not add new third-party integrations (maps, geolocation, external flag APIs).",
    "Do not change backend data model or persistence for countries or relationship status (this is a UI/UX change only)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}