{
  "kind": "build_request",
  "title": "Allow paired users to change relationship status after initial selection",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-44",
      "text": "Update the backend relationship-status update logic so that, after the initial relationship status has been set, either partner can change the relationship status later and the new value is saved to BOTH user profiles.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-6"
        ],
        "quotes": [
          "pon que se pueda cambiar el status"
        ]
      },
      "acceptanceCriteria": [
        "When no relationship status exists yet for the couple, calling `setRelationshipStatus` is still allowed only for the invited user (the user with `can_set_relationship_status == true`).",
        "When a relationship status already exists for the couple, either paired user can successfully call the backend to change it.",
        "On a successful change, the updated relationship status is persisted to both partners’ `relationship_status` fields.",
        "Unauthorized callers (not paired, or not allowed to set the initial status when it is still unset) receive a clear error via backend trap."
      ]
    },
    {
      "id": "REQ-45",
      "text": "Update the frontend relationship-status mutation logic to support both flows: (1) initial status selection restricted to the invited user and (2) subsequent status changes allowed by either paired user when a status already exists.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-6"
        ],
        "quotes": [
          "pon que se pueda cambiar el status"
        ]
      },
      "acceptanceCriteria": [
        "If no relationship status exists yet, attempting to set it from a user who is not the invited user is blocked with a clear English error message.",
        "If a relationship status already exists, either paired user can submit a status change successfully from the UI.",
        "After a successful status change, React Query invalidates/refetches `['relationshipStatus']`, `['currentUserProfile']`, and any partner/profile queries needed so the new status (and header heart color) updates immediately without a hard refresh."
      ]
    },
    {
      "id": "REQ-46",
      "text": "Add a Settings UI control that allows a paired user to change the existing relationship status (using the same set of status options already used in the app), and show an English success toast after saving.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-6"
        ],
        "quotes": [
          "pon que se pueda cambiar el status"
        ]
      },
      "acceptanceCriteria": [
        "In Settings, when the user is paired and a relationship status exists, a \"Change Relationship Status\" control is visible.",
        "Invoking the control presents the existing relationship options (Friendship, Almost Something, Situationship, Relationship, Engaged, Married) and saves the selection.",
        "On success, the UI shows a toast: \"Relationship status updated successfully 💛\" and the displayed status/heart color updates to match the new value.",
        "If the user is not paired, the Settings status-change control is hidden or disabled in a way consistent with the rest of the Settings page patterns."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Do not edit files under `frontend/src/components/ui` or any other immutable frontend paths listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing UI text added/changed."
  ],
  "nonGoals": [
    "Do not add new relationship status options beyond the existing list.",
    "Do not add third-party integrations or notifications related to status changes.",
    "Do not redesign unrelated areas of the app (pairing, check-ins, streak) beyond what is needed to support changing the relationship status."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}