{
  "kind": "build_request",
  "title": "Require mandatory country selection and include all world countries",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-37",
      "text": "Update the frontend country dataset to include all countries worldwide (use a complete ISO 3166-1 alpha-2 list), ensuring the selectable list used by the country selector contains every country/territory intended for the app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "tienen que estar todos los paises del mundo y tiene que ser obligatorio seleccionar pais"
        ]
      },
      "acceptanceCriteria": [
        "The exported `COUNTRIES` list includes all countries worldwide (complete ISO 3166-1 alpha-2 coverage, not a small subset).",
        "The country list is unique by `code`, has non-empty `name` values, and remains sorted alphabetically by country name.",
        "The searchable dropdown in `CountriesMapSelector` can find and select any country in the updated list."
      ]
    },
    {
      "id": "REQ-38",
      "text": "Make country selection mandatory for onboarding: if an authenticated user does not yet have a country saved in their profile, the app must block normal app usage and present the profile setup flow until a valid country is selected and saved.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "tienen que estar todos los paises del mundo y tiene que ser obligatorio seleccionar pais"
        ]
      },
      "acceptanceCriteria": [
        "If `getCallerUserProfile()` returns `null`, the existing profile setup dialog is shown (current behavior preserved).",
        "If `getCallerUserProfile()` returns a profile whose `country` is missing/empty, the profile setup dialog is shown and the user cannot proceed into pairing/dashboard/settings views until a country is saved.",
        "The Profile Setup submit button remains disabled until both a non-empty name and a selected country are present.",
        "All user-facing validation/error messages introduced or changed for this requirement are in English."
      ]
    },
    {
      "id": "REQ-39",
      "text": "Enforce mandatory country selection on the backend: reject profile saves that do not include a valid country value, so a user cannot persist a profile without selecting a country.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "tienen que estar todos los paises del mundo y tiene que ser obligatorio seleccionar pais"
        ]
      },
      "acceptanceCriteria": [
        "`saveCallerUserProfile` traps/rejects when the incoming `country` value is null/absent or an empty string (after trimming).",
        "When `saveCallerUserProfile` succeeds, the stored profile’s `country` is set to the provided value and remains persisted for future reads.",
        "Existing server-managed fields (e.g., `premium`, `partner_ref`, `relationship_status`, `can_set_relationship_status`, `streak_count`, `last_checkin_date`) continue to be preserved as they are today when saving profiles."
      ]
    },
    {
      "id": "REQ-40",
      "text": "Update the frontend profile save flow to always submit a selected country (no undefined/empty country values) and to surface backend validation failures with a clear English error message prompting the user to select a country.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "tienen que estar todos los paises del mundo y tiene que ser obligatorio seleccionar pais"
        ]
      },
      "acceptanceCriteria": [
        "The frontend mutation that saves a user profile does not send `country` as undefined/empty when the user is required to choose a country.",
        "If the backend rejects a save due to missing country, the UI shows an English error message indicating country selection is required.",
        "Settings country edit continues to prevent saving when no country is selected (current UX preserved)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or anything under `frontend/src/components/ui` (compose existing components instead).",
    "Backend must remain a single Motoko actor with all logic in `backend/main.mo`.",
    "Only add/modify `backend/migration.mo` if a state upgrade is strictly necessary (conditional migration policy)."
  ],
  "nonGoals": [
    "Creating or upgrading the interactive SVG world map to accurately include clickable shapes for every country (the requirement is that all countries are available for selection; the map can remain low-fidelity).",
    "Adding geolocation/GPS-based auto-detection of country.",
    "Adding third-party APIs or external datasets fetched at runtime."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}