{
  "kind": "build_request",
  "title": "Add avatar creation and profile avatars",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-47",
      "text": "Extend the backend `UserProfile` data model to persist a user avatar value, and expose it through existing profile query methods (`getCallerUserProfile`, `getUserProfile`).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "pon para crear avatars"
        ]
      },
      "acceptanceCriteria": [
        "`backend/main.mo` `UserProfile` includes a new persisted field representing the user’s avatar (e.g., a Text value).",
        "`getCallerUserProfile` and `getUserProfile` return the avatar field for existing users (including when unset).",
        "Avatar data is stored per-user and does not affect pairing/check-in/streak logic."
      ]
    },
    {
      "id": "REQ-48",
      "text": "Update `saveCallerUserProfile` so callers can set/update their avatar while continuing to preserve all server-managed or pairing-related fields (e.g., `premium`, `partner_ref`, `relationship_status`, `streak_count`, `last_checkin_date`) exactly as the current implementation does for other editable fields.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "pon para crear avatars"
        ]
      },
      "acceptanceCriteria": [
        "Saving a profile updates only user-editable fields (name, country, avatar) and preserves existing values for premium/pairing/relationship/streak fields.",
        "Backend rejects invalid avatar payloads with a clear trap message (English) if validation is implemented.",
        "If a user has no prior profile, the created default profile includes a safe default avatar value (or empty/unset per the chosen representation)."
      ]
    },
    {
      "id": "REQ-49",
      "text": "Add a conditional migration for existing persisted user profile state to initialize the new avatar field to a safe default for all existing users, following the project’s migration policy.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "pon para crear avatars"
        ]
      },
      "acceptanceCriteria": [
        "If old state exists, upgrading does not trap due to missing avatar data.",
        "Existing users keep all previously stored fields unchanged, with avatar initialized to the default.",
        "New deployments (no prior state) do not require migration to function."
      ]
    },
    {
      "id": "REQ-50",
      "text": "Add a frontend avatar creation/selection UI that lets an authenticated user set or change their avatar and saves it using the existing profile save flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "pon para crear avatars"
        ]
      },
      "acceptanceCriteria": [
        "Profile setup and/or Settings provides an avatar control where the user can create/select an avatar and persist it via the profile save mutation.",
        "After saving, the current user profile query is invalidated/refetched and the updated avatar is shown without a full page reload.",
        "All user-facing UI strings introduced for avatar creation are in English."
      ]
    },
    {
      "id": "REQ-51",
      "text": "Display user avatars in the paired experience using existing profile data: show the current user avatar and partner avatar wherever the app presents identity context (e.g., header/connection area), with sensible fallbacks when an avatar is not set.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "pon para crear avatars"
        ]
      },
      "acceptanceCriteria": [
        "When paired, the UI can render both the caller’s avatar and the partner’s avatar using `useGetCallerUserProfile` and partner profile data from `usePairingStatus`.",
        "If either avatar is missing/unset, the UI renders a consistent fallback (e.g., initials/placeholder) without breaking layout.",
        "Avatar rendering does not require any backend image hosting; it uses the stored avatar representation."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in `backend/main.mo`.",
    "Only add/modify `backend/migration.mo` if required to safely upgrade existing persisted state (conditional migration policy).",
    "Do not edit frontend files under `frontend/src/components/ui` or any other immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing text introduced by this change."
  ],
  "nonGoals": [
    "Implementing third-party avatar services or external image hosting/storage.",
    "Adding third-party authentication providers (only Internet Identity is supported).",
    "Building real-time avatar syncing beyond the existing React Query refetch/invalidation behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}