{
  "kind": "build_request",
  "title": "Add country map selection and save each user's country in their profile",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-32",
      "text": "Extend the backend `UserProfile` data model to include a persisted country field for each user (e.g., `country : ?Text` storing an ISO country code or a stable country identifier), and expose it through existing profile query methods.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "falta el mapa de los paises y que cada user elija su pais"
        ]
      },
      "acceptanceCriteria": [
        "Calling `getCallerUserProfile()` returns the caller profile including the new country field.",
        "Calling `getUserProfile(principal)` returns the user profile including the new country field (subject to existing access rules).",
        "Existing users without a country saved do not break profile reads (country is `null`/unset by default)."
      ]
    },
    {
      "id": "REQ-33",
      "text": "Update `saveCallerUserProfile(profile : UserProfile)` so that saving profile details cannot unintentionally overwrite server-managed or pairing-related fields; it must preserve existing values for `premium`, `partner_ref`, `relationship_status`, `can_set_relationship_status`, `streak_count`, and `last_checkin_date`, while allowing the caller to update only user-editable fields (at minimum: `name` and the new `country` field).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "falta el mapa de los paises y que cada user elija su pais"
        ]
      },
      "acceptanceCriteria": [
        "Saving a profile updates the caller’s `name` and `country` but does not change pairing, relationship status, premium, or streak fields.",
        "A malicious/incorrect frontend payload cannot clear `partner_ref` or reset streak/status via `saveCallerUserProfile`."
      ]
    },
    {
      "id": "REQ-34",
      "text": "Add a conditional backend migration (only if required by existing persisted state) to initialize the new profile country field for all existing users to `null`/unset (or another safe default) without modifying any other existing fields.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "falta el mapa de los paises y que cada user elija su pais"
        ]
      },
      "acceptanceCriteria": [
        "After upgrade, pre-existing user profiles continue to load successfully.",
        "Country is initialized to the chosen default for existing profiles and can be updated later."
      ]
    },
    {
      "id": "REQ-35",
      "text": "Add a frontend “Countries Map” selection UI that allows a user to choose their country from an interactive map (with a usability fallback such as a searchable dropdown/list), and store the selected value in the user profile via the existing profile save flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "falta el mapa de los paises y que cada user elija su pais"
        ]
      },
      "acceptanceCriteria": [
        "The profile setup experience includes a country selection step/control with a visible map-based interaction.",
        "If the user cannot or does not want to use the map, they can still select a country via a searchable dropdown/list.",
        "Submitting the profile saves both `name` and `country` and refreshes `currentUserProfile` via React Query invalidation."
      ]
    },
    {
      "id": "REQ-36",
      "text": "Allow an already-onboarded user to change their saved country later from within the app (e.g., in Settings), using the same country map selector and persisting the change to their profile.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "falta el mapa de los paises y que cada user elija su pais"
        ]
      },
      "acceptanceCriteria": [
        "Settings includes a section to view and edit the current user’s country.",
        "Updating the country persists and is reflected after refresh/reload (pulled from `getCallerUserProfile`).",
        "User-facing text for this feature is in English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo`; do not introduce additional backend services.",
    "Do not edit files under `frontend/src/components/ui` or any other `frontend.immutablePaths` entries; compose existing UI components instead.",
    "Do not add third-party auth providers or external databases/services for country data."
  ],
  "nonGoals": [
    "Automatic geolocation/GPS-based country detection.",
    "Rendering a high-fidelity GIS map with full administrative boundaries.",
    "Storing precise location data (coordinates, addresses) beyond a country identifier."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}