{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Avatar creation UI and paired avatar display",
  "requirements": [
    {
      "id": "REQ-50",
      "summary": "Add avatar creation/selection controls to profile setup and settings, persisting via the existing save profile flow with React Query refetch.",
      "acceptanceCriteria": [
        "Profile setup and/or Settings provides an avatar control where the user can create/select an avatar and persist it via the profile save mutation.",
        "After saving, the current user profile query is invalidated/refetched and the updated avatar is shown without a full page reload.",
        "All user-facing UI strings introduced for avatar creation are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/profile/AvatarPicker.tsx",
          "operation": "create",
          "description": "Create an avatar creation/selection component (stored-avatar representation as text, e.g., emoji/preset string) with a clear empty/default option and lightweight validation. Use shadcn-ui building blocks already present in the app for consistent inputs and buttons. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/profile/avatarUtils.ts",
          "operation": "create",
          "description": "Add small utilities for avatar normalization/validation and generating a consistent fallback avatar label when missing/unset. Ensure all defaults are safe and deterministic. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/profile/useSaveCallerUserProfile.ts",
          "operation": "modify",
          "description": "Extend the save profile hook to accept an avatar value and include it in the profile payload sent to the existing save flow. Prefer merging with any cached current profile data (via React Query) so unchanged fields remain stable on the frontend side, while still relying on the backend to preserve server-managed fields. Keep invalidation of ['currentUserProfile'] so the updated avatar shows without a full reload. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/profile/ProfileSetupDialog.tsx",
          "operation": "modify",
          "description": "Add the AvatarPicker control to the profile setup dialog and include avatar in the save mutation payload (English labels/help text). Keep existing name/country behavior and prevent modal dismissal while saving. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/settings/SettingsView.tsx",
          "operation": "modify",
          "description": "Add an Avatar section to Settings that lets the authenticated user view, edit, and save their avatar using the same save profile flow (with toast feedback in English). Ensure saving triggers profile refetch via existing query invalidation. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the avatar UI is only reachable for authenticated users as part of the existing authenticated app flow (leveraging the authorization component’s authentication patterns already in use). No new routes required. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-51",
      "summary": "Render current user and partner avatars in the paired identity context with consistent fallbacks and no image hosting.",
      "acceptanceCriteria": [
        "When paired, the UI can render both the caller’s avatar and the partner’s avatar using `useGetCallerUserProfile` and partner profile data from `usePairingStatus`.",
        "If either avatar is missing/unset, the UI renders a consistent fallback (e.g., initials/placeholder) without breaking layout.",
        "Avatar rendering does not require any backend image hosting; it uses the stored avatar representation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/avatars/AvatarBadge.tsx",
          "operation": "create",
          "description": "Create a small presentational component to render an avatar from the stored text representation (e.g., emoji/preset) with a consistent fallback (e.g., initials) and stable sizing for headers. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Update the paired identity context in the header/connection area to show both the current user avatar and partner avatar using `useGetCallerUserProfile()` and `usePairingStatus().partnerProfile`. Use AvatarBadge and fall back gracefully when either avatar is missing/unset. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/pairing/usePairingStatus.ts",
          "operation": "modify",
          "description": "Expose partner avatar data in the pairing status return shape (derived from `partnerProfile`) to simplify consumption by identity-context UI. Keep existing query behavior and keys intact. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}