{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Enable relationship status changes for paired users in UI",
  "requirements": [
    {
      "id": "REQ-45",
      "summary": "Update relationship-status mutation logic to allow initial set only by invited user, and allow later changes by either paired user once a status exists.",
      "acceptanceCriteria": [
        "If no relationship status exists yet, attempting to set it from a user who is not the invited user is blocked with a clear English error message.",
        "If a relationship status already exists, either paired user can submit a status change successfully from the UI.",
        "After a successful status change, React Query invalidates/refetches ['relationshipStatus'], ['currentUserProfile'], and any partner/profile queries needed so the new status (and header heart color) updates immediately without a hard refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/relationshipStatus/useSetRelationshipStatus.ts",
          "operation": "modify",
          "description": "Adjust the mutation guard to support two flows: (1) if cached/fetched relationship status is null/unset, enforce \"invited user only\" (using the existing profile flag check); (2) if a relationship status already exists, allow the mutation for either paired user. Ensure errors are thrown in clear English when blocked."
        },
        {
          "path": "frontend/src/features/relationshipStatus/useSetRelationshipStatus.ts",
          "operation": "modify",
          "description": "Strengthen React Query refresh behavior after a successful status change: invalidate/refetch ['relationshipStatus'], ['currentUserProfile'], and partner/profile-related queries (including parameterized partner profile keys) so the dashboard display and AppLayout heart color update immediately."
        }
      ]
    },
    {
      "id": "REQ-46",
      "summary": "Add a Settings control for paired users to change an existing relationship status and show an English success toast after saving.",
      "acceptanceCriteria": [
        "In Settings, when the user is paired and a relationship status exists, a \"Change Relationship Status\" control is visible.",
        "Invoking the control presents the existing relationship options (Friendship, Almost Something, Situationship, Relationship, Engaged, Married) and saves the selection.",
        "On success, the UI shows a toast: \"Relationship status updated successfully 💛\" and the displayed status/heart color updates to match the new value.",
        "If the user is not paired, the Settings status-change control is hidden or disabled in a way consistent with the rest of the Settings page patterns."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/relationshipStatus/relationshipStatusOptions.ts",
          "operation": "create",
          "description": "Create a shared, single source of truth for the existing relationship status options list used across the app (Friendship, Almost Something, Situationship, Relationship, Engaged, Married) to avoid duplication between the chooser and the new Settings control."
        },
        {
          "path": "frontend/src/features/relationshipStatus/ChooseRelationshipStatusView.tsx",
          "operation": "modify",
          "description": "Refactor to import the shared relationship status options from the new options module so the chooser and Settings use the same list (no new options introduced). Keep all user-facing text in English."
        },
        {
          "path": "frontend/src/features/relationshipStatus/ChangeRelationshipStatusControl.tsx",
          "operation": "create",
          "description": "Add a Settings-ready UI control component that: shows \"Change Relationship Status\", presents the existing options for selection, calls the existing set-relationship-status mutation, and on success shows the toast \"Relationship status updated successfully 💛\". Use the app's existing UI primitives (without editing any immutable ui component files)."
        },
        {
          "path": "frontend/src/features/settings/SettingsView.tsx",
          "operation": "modify",
          "description": "Wire the new \"Change Relationship Status\" control into Settings: show it only when the user is paired and a relationship status exists (otherwise hide/disable consistent with Settings patterns). Ensure it uses the same option list and the status/heart color updates via the existing query invalidations."
        }
      ]
    }
  ]
}